software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/InsertParticipant.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <InsertRequest xmlns="http://wapi.wustl.edu/WAPI">
            <object>
                <ns1:AbstractDomainObject activityStatus="Active" 
					  identifier="0"
					  firstName="John"
                      lastName="Doe"
					  xsi:type="ns2:Participant"
                                          xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.common.domain.ws"
                                          xmlns:ns2="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">

                    <ns2:raceCollection>
                        <ns2:Race identifier="0" raceName="Asian"/>
                        <ns2:Race identifier="0" raceName="Unknown"/>
                        <ns2:Race identifier="0" raceName="White"/>
                    </ns2:raceCollection>
                    
		            <ns2:collectionProtocolRegistrationCollection>
                        <ns2:CollectionProtocolRegistration activityStatus="Active" identifier="0"
                                                            protocolParticipantIdentifier="CP_A002"
                                                            registrationDate="2011-07-26T13:21:13.379Z">
                            <ns2:collectionProtocol>
                                <ns2:CollectionProtocol identifier="1" />
                            </ns2:collectionProtocol>
                        </ns2:CollectionProtocolRegistration>
                    </ns2:collectionProtocolRegistrationCollection>

                    <ns2:participantRecordEntryCollection>
                        <ns3:ParticipantRecordEntry identifier="0" xmlns:ns3="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.deintegration.ws"/>
                        <ns3:ParticipantRecordEntry identifier="0" xmlns:ns3="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.deintegration.ws"/>
                    </ns2:participantRecordEntryCollection>


                    <ns2:participantMedicalIdentifierCollection>
                        <ns2:ParticipantMedicalIdentifier medicalRecordNumber="MRN-AA-CP529C" identifier="0">
			                <ns2:site>
                                <ns2:Site identifier="1" name="In Transit" />
                            </ns2:site>
                        </ns2:ParticipantMedicalIdentifier>
                    </ns2:participantMedicalIdentifierCollection>
                </ns1:AbstractDomainObject>
            </object>
        </InsertRequest>
    </soapenv:Body>
</soapenv:Envelope>